{
  "timeline": [
    {
      "category": "politics",
      "content": "Bill Clinton signed the Defense of Marriage Act (DOMA), which defined marriage as exclusively between one man and one woman, granting states the power to reject recognition of same-sex marriages. Consequently, this resulted in the denial of federal protections, privileges, access to employment benefits for partners, inheritance rights, immigration and residency rights, and complications with joint tax returns. In summary, a single stroke of a pen by one individual eliminated the rights of millions of people, effectively erasing their ability to enjoy equal treatment and opportunities in various aspects of life.",
      "date": "21-09-96",
      "decade": "1990",
      "imageUrl": "https://github.com/nils-n/progress-timeline/blob/main/assets/images/Bill_Clinton_signing.jpeg?raw=true",
      "title": "Bill Clinton Signing"
    },
    {
      "category": "politics",
      "content": "The Supreme Court of the United States strikes down sodomy laws in Lawrence v. Texas, decriminalizing same-sex sexual activity",
      "date": "26-06-03",
      "decade": "2000",
      "imageUrl": "https://github.com/nils-n/progress-timeline/blob/main/assets/images/Lawrance_v._Texas.jpeg?raw=true",
      "title": "Lawrence v. Texas"
    },
    {
      "category": "politics",
      "content": "The “Don’t Ask, Don’t Tell” (DADT) policy, which prohibited openly gay individuals from serving in the U.S. military, is repealed.",
      "date": "21-12-93",
      "decade": "1990",
      "imageUrl": "https://github.com/nils-n/progress-timeline/blob/main/assets/images/DADT_repeal.jpeg?raw=true",
      "title": "Don't ask, don't tell"
    },
    {
      "category": "politics",
      "content": "The Stonewall Inn was a well-known gay bar where individuals could gather to socialize, dance, and enjoy the jukebox. The establishment had Mafia protection through regular payoffs, as the Mafia had invested in the bar. The police raided the bar, suspecting involvement in bootlegging liquor. Patrons were required to present identification, and those who were not arrested were escorted out. A crowd began to gather outside, and as more people arrived, they were met with thrown beer bottles. Gradually, the situation escalated into a riot, with some arrested individuals being freed by the enraged crowd. The following night, although smaller confrontations between the LGBTQ+ community and the police occurred, the riot had subsided. Those who were present became members of the Gay Liberation Front, continuing to fight for the rights and equality of the queer community.",
      "date": "21-06-69",
      "decade": "1960",
      "imageUrl": "https://github.com/nils-n/progress-timeline/blob/main/assets/images/The_Plaque_at_Stonewall_Inn.jpeg?raw=true",
      "title": "The Plaque at the Stonewall In"
    },
    {
      "category": "artist",
      "content": "Frida Kahlo, the Mexican painter, left an indelible mark on the art world and LGBTQ+ representation. Known for her vibrant self-portraits, Kahlo explored themes of identity, gender, and sexuality. Her art often depicted her own experiences and challenges, including her bisexuality and her relationships with both men and women. Kahlo's work challenged societal norms and celebrated individuality and self-expression. She became an icon for embracing one's true self and for the powerful representation of queer identities in art. Frida Kahlo's unique artistic style and her unapologetic exploration of her own truth continue to inspire and resonate with audiences around the world.",
      "date": "13-07-54",
      "decade": "1950",
      "imageUrl": "https://github.com/nils-n/progress-timeline/blob/main/assets/images/frida-kahlo-7464591_960_720.jpeg?raw=true",
      "title": "Frida Kahlo"
    },
    {
      "category": "artist",
      "content": "David Bowie, the legendary British musician and actor, left an indelible mark on both the music industry and LGBTQ+ representation. Known for his chameleon-like personas and boundary-pushing artistry, Bowie challenged conventional norms of gender and sexuality. His iconic androgynous style and exploration of fluid identities through his music and stage presence opened doors for queer expression and acceptance. Bowie's alter ego Ziggy Stardust became an emblem for the LGBTQ+ community, embracing nonconformity and encouraging self-expression. Through his art, Bowie transcended boundaries, inspiring generations to embrace their true selves and celebrating the beauty of individuality. His influence on music and LGBTQ+ culture is immeasurable.",
      "date": "20-04-87",
      "decade": "1980",
      "imageUrl": "https://github.com/nils-n/progress-timeline/blob/main/assets/images/David_Bowie_(1987).jpeg?raw=true",
      "title": "David Bowie"
    },
    {
      "category": "artist",
      "content": "Marsha P. Johnson was an influential transgender rights activist and key figure in the LGBTQ+ liberation movement. As a prominent participant in the 1969 Stonewall uprising, Johnson's activism played a pivotal role in igniting the fight for LGBTQ+ rights. She co-founded Street Transvestite Action Revolutionaries (STAR), a group that provided support and advocacy for homeless transgender youth. Johnson's tireless efforts and advocacy made her a beacon of hope and resilience for marginalized communities. Her visibility, courage, and unwavering dedication to justice and equality continue to inspire and empower LGBTQ+ individuals today. Marsha P. Johnson's legacy as an icon and trailblazer will forever be celebrated .",
      "date": "24-06-73",
      "decade": "1970",
      "imageUrl": "/Marsha_P._Johnson_in_the_1973_NYC_Gay_Pride_Parade.jpeg?raw=true",
      "title": "Marsha P. Johnson"
    },
    {
      "category": "artist",
      "content": "Laverne Cox, the talented American actress and transgender rights advocate, has had a profound impact on the entertainment industry and LGBTQ+ visibility. Cox rose to prominence for her groundbreaking portrayal of Sophia Burset in the hit series 'Orange Is the New Black'. As a prominent transgender actress, she has used her platform to advocate for trans rights, raise awareness about the challenges faced by the trans community, and promote greater inclusivity in media. Cox's activism, eloquence, and grace have made her a powerful voice for trans representation and an inspiration for countless individuals, leaving a lasting legacy in the fight for LGBTQ+ equality.",
      "date": "20-04-87",
      "decade": "1980",
      "imageUrl": "https://github.com/nils-n/progress-timeline/blob/main/assets/images/Laverne_Cox_at_SF_Trans_March_20150626.jpeg?raw=true",
      "title": "Lavarne Cox at Trans March 2015"
    },
    {
      "category": "artist",
      "content": "Keith Haring, the American artist and activist, was a trailblazer in the art world and a champion for LGBTQ+ rights. Through his iconic, vibrant, and accessible artwork, Haring addressed themes of love, unity, and social justice. As an openly gay artist during the height of the AIDS crisis, Haring used his platform to raise awareness about the disease and advocate for safe sex practices. His bold, graffiti-inspired imagery became synonymous with the 1980s New York City art scene and has since become globally recognized. Keith Haring's legacy as an artist and activist continues to inspire generations, leaving an enduring impact on both the art world and LGBTQ+ advocacy.",
      "date": "27-06-86",
      "decade": "1980",
      "imageUrl": "https://github.com/nils-n/progress-timeline/blob/main/assets/images/Keith_Haring_1986.jpeg?raw=true",
      "title": "Keith Haring"
    },
    {
      "category": "artist",
      "content": "Jean-Michel Basquiat, the influential American artist, made an indelible mark on the art world and LGBTQ+ representation. Known for his raw and expressive style, Basquiat explored themes of identity, race, and sexuality. As an openly gay artist of Haitian and Puerto Rican descent, Basquiat challenged the status quo and broke barriers in the predominantly white art scene of the 1980s. His bold and vibrant artwork captured the attention of the art world, elevating street art to the realm of high art. Basquiat's legacy as a queer artist and his unique ability to convey powerful social messages through his art continue to inspire and captivate audiences worldwide.",
      "date": "01-09-81",
      "decade": "1980",
      "imageUrl": "https://github.com/nils-n/progress-timeline/blob/main/assets/images/Jean-Michel_Basquiat_by_Miguel_Rodez_2016.jpeg?raw=true",
      "title": "Jean-Michel Basquiat"
    },
    {
      "category": "artist",
      "content": "Audre Lorde, the African American writer, poet, and activist, made a profound impact on literature, feminism, and LGBTQ+ representation. Lorde's powerful and unapologetic writings delved into intersectional feminism, racism, and lesbian identity. Through her poetry and essays, she shed light on the experiences of marginalized communities, emphasizing the importance of embracing and celebrating one's unique identity. Lorde's work challenged societal norms and advocated for social justice and equality. As an openly lesbian woman of color, she became a prominent voice for the LGBTQ+ community, inspiring generations with her eloquence, courage, and unwavering commitment to creating a more inclusive and equitable world.",
      "date": "13-05-012",
      "decade": "2010",
      "imageUrl": "https://github.com/nils-n/progress-timeline/blob/main/assets/images/Audre_Lorde_und_May_Ayim.jpeg?raw=true",
      "title": "Audre Lorde, The Berlin Years."
    },
    {
      "category": "artist",
      "content": "Ellen DeGeneres, the beloved American comedian, actress, and TV host, has been a trailblazer for LGBTQ+ representation in the entertainment industry. After coming out as a lesbian in 1997, she faced significant backlash, but her authenticity and resilience paved the way for greater visibility and acceptance. Her groundbreaking sitcom 'Ellen' became the first prime-time show to feature an openly gay lead character. Since then, DeGeneres has become a powerful advocate for LGBTQ+ rights and a symbol of love, inclusivity, and kindness. Her immense popularity and influential platform have helped shape public perceptions and promote understanding, making her an icon for the LGBTQ+ community.",
      "date": "08-09-03",
      "decade": "2000",
      "imageUrl": "https://github.com/nils-n/progress-timeline/blob/main/assets/images/Ellen_DeGeneres-2009.jpeg?raw=true",
      "title": "Ellen DeGeneres"
    },
    {
      "category": "science",
      "content": "Alan Turing, the brilliant British mathematician and computer scientist, played a pivotal role in the development of modern computing and artificial intelligence. Turing's contributions to codebreaking during World War II, notably his work on the Enigma machine, helped shorten the war and saved countless lives. As an openly gay man in a time when homosexuality was criminalized, Turing faced persecution and tragedy. His legacy as a visionary scientist, pioneer of computer science, and symbol of resilience in the face of adversity continues to inspire and shape our world.",
      "date": "23-06-1912",
      "decade": "1910",
      "imageUrl": "https://github.com/nils-n/progress-timeline/blob/main/assets/images/Alan_Turing_in_1935.jpeg?raw=true",
      "title": "Alan Turing"
    },
    {
      "title": "Billie Jean King",
      "content": "Billie Jean King, a legendary tennis player, made history on September 20, 1973, when she defeated Bobby Riggs in the 'Battle of the Sexes' tennis match. This groundbreaking event championed gender equality in sports and had a profound impact on society. King's victory showcased women's athletic abilities and challenged the notion that men were superior in sports. She remains an iconic figure, inspiring generations of athletes to pursue their dreams without limitations.",
      "date": "September 20, 1973",
      "decade": "1970s",
      "category": "sport",
      "imageUrl": "https://media.istockphoto.com/id/1147544807/vector/thumbnail-image-vector-graphic.jpg?s=612x612&w=0&k=20&c=rnCKVbdxqkjlcs3xH87-9gocETqpspHFXu5dIGB4wuM="
    },
    {
      "title": "Martina Navratilova",
      "content": "Martina Navratilova is one of the most accomplished tennis players in history. Dominating the sport throughout the 1980s, Navratilova won a record 18 Grand Slam singles titles, including a remarkable streak of six consecutive victories at Wimbledon. Her aggressive style of play revolutionized women's tennis and set new standards for athleticism. Navratilova's achievements and advocacy for LGBTQ+ rights have made her an influential figure both on and off the court.",
      "date": "1978-1990",
      "decade": "1980s",
      "category": "sport",
      "imageUrl": "https://media.istockphoto.com/id/1147544807/vector/thumbnail-image-vector-graphic.jpg?s=612x612&w=0&k=20&c=rnCKVbdxqkjlcs3xH87-9gocETqpspHFXu5dIGB4wuM="
    },
    {
      "title": "Greg Louganis",
      "content": "Greg Louganis is widely regarded as one of the greatest divers in history. Despite facing numerous challenges and personal adversity, Louganis won a total of four Olympic gold medals in diving. His achievements at the 1984 and 1988 Olympics showcased his exceptional skills, precision, and grace. Louganis is not only remembered for his remarkable athletic accomplishments but also for his bravery in overcoming the stigma surrounding HIV/AIDS. He has become an influential advocate for LGBTQ+ rights in the sporting world.",
      "date": "1984, 1988",
      "decade": "1980s",
      "category": "sport",
      "imageUrl": "https://media.istockphoto.com/id/1147544807/vector/thumbnail-image-vector-graphic.jpg?s=612x612&w=0&k=20&c=rnCKVbdxqkjlcs3xH87-9gocETqpspHFXu5dIGB4wuM="
    },
    {
      "title": "Justin Fashanu",
      "content": "In 1990, Justin Fashanu became the first openly gay male professional footballer. His announcement broke significant barriers in the sport and raised awareness about LGBTQ+ representation in football. Fashanu's courage and authenticity paved the way for future generations of LGBTQ+ athletes. Although his career faced challenges, his impact on the conversation around inclusivity and acceptance remains significant.",
      "date": "1990",
      "decade": "1990s",
      "category": "sport",
      "imageUrl": "https://media.istockphoto.com/id/1147544807/vector/thumbnail-image-vector-graphic.jpg?s=612x612&w=0&k=20&c=rnCKVbdxqkjlcs3xH87-9gocETqpspHFXu5dIGB4wuM="
    },
    {
      "title": "Orlando Cruz",
      "content": "Orlando Cruz made history in 2012 when he became the first openly gay active professional boxer. By publicly sharing his sexual orientation, Cruz challenged stereotypes in a traditionally masculine sport and became an inspiration for LGBTQ+ athletes around the world. His bravery and resilience have made a lasting impact on the boxing community, promoting inclusivity and acceptance.",
      "date": "2012",
      "decade": "2010s",
      "category": "sport",
      "imageUrl": "https://media.istockphoto.com/id/1147544807/vector/thumbnail-image-vector-graphic.jpg?s=612x612&w=0&k=20&c=rnCKVbdxqkjlcs3xH87-9gocETqpspHFXu5dIGB4wuM="
    },
    {
      "title": "Megan Rapinoe",
      "content": "Megan Rapinoe, a prominent figure in women's soccer, led the US women's national team to victory in the 2019 FIFA Women's World Cup. As the team's co-captain, Rapinoe not only showcased her exceptional skills on the field but also used her platform to advocate for LGBTQ+ rights and gender equality. Her unwavering dedication to social justice has made her an influential voice both within and outside the world of sports.",
      "date": "2019",
      "decade": "2010s",
      "category": "sport",
      "imageUrl": "https://media.istockphoto.com/id/1147544807/vector/thumbnail-image-vector-graphic.jpg?s=612x612&w=0&k=20&c=rnCKVbdxqkjlcs3xH87-9gocETqpspHFXu5dIGB4wuM="
    },
    {
      "title": "Tom Daley",
      "content": "Tom Daley, a British diver, has achieved remarkable success in the sport and become an influential figure for LGBTQ+ youth worldwide. With multiple Olympic medals to his name, including two bronze medals in 2012 and 2016, Daley has proven himself as one of the best divers of his generation. Throughout his career, he has fearlessly embraced his identity and used his platform to advocate for LGBTQ+ rights, becoming an inspiring role model for aspiring athletes.",
      "date": "2012, 2016",
      "decade": "2010s",
      "category": "sport",
      "imageUrl": "https://media.istockphoto.com/id/1147544807/vector/thumbnail-image-vector-graphic.jpg?s=612x612&w=0&k=20&c=rnCKVbdxqkjlcs3xH87-9gocETqpspHFXu5dIGB4wuM="
    },
    {
      "title": "Gareth Thomas",
      "content": "Gareth Thomas, a former Welsh rugby union player, made headlines in 2009 when he publicly came out as gay. By becoming the first openly gay professional rugby union player, Thomas challenged stereotypes and brought important conversations about inclusivity to the forefront. His bravery and advocacy have had a profound impact on the sporting community, paving the way for greater acceptance of LGBTQ+ athletes.",
      "date": "2009",
      "decade": "2000s",
      "category": "sport",
      "imageUrl": "https://media.istockphoto.com/id/1147544807/vector/thumbnail-image-vector-graphic.jpg?s=612x612&w=0&k=20&c=rnCKVbdxqkjlcs3xH87-9gocETqpspHFXu5dIGB4wuM="
    },
    {
      "title": "Sue Bird",
      "content": "Sue Bird is widely recognized as one of the most accomplished players in the history of the Women's National Basketball Association (WNBA). Throughout her career, Bird has won multiple championships, solidifying her status as an all-time great. Alongside her exceptional basketball skills, she has been an outspoken advocate for LGBTQ+ rights in sports. Bird's leadership both on and off the court has made a lasting impact on the world of women's basketball.",
      "date": "2004-present",
      "decade": "2000s",
      "category": "sport",
      "imageUrl": "https://media.istockphoto.com/id/1147544807/vector/thumbnail-image-vector-graphic.jpg?s=612x612&w=0&k=20&c=rnCKVbdxqkjlcs3xH87-9gocETqpspHFXu5dIGB4wuM="
    },
    {
      "title": "Caster Semenya",
      "content": "Caster Semenya, an Olympic gold medalist in track and field, has faced significant challenges and discrimination due to her gender identity. Despite controversy and legal battles surrounding regulations on testosterone levels in female athletes, Semenya has remained resilient. Her achievements on the track and her fight for equality have sparked important discussions about gender and inclusivity in sports.",
      "date": "2009-2016",
      "decade": "2010s",
      "category": "sport",
      "imageUrl": "https://media.istockphoto.com/id/1147544807/vector/thumbnail-image-vector-graphic.jpg?s=612x612&w=0&k=20&c=rnCKVbdxqkjlcs3xH87-9gocETqpspHFXu5dIGB4wuM="
    },
    {
      "title": "Alan Turing",
      "content": "Alan Turing was a British mathematician, logician, and computer scientist who played a crucial role in the development of modern computing. During World War II, he was instrumental in breaking the German Enigma code, which significantly aided the Allied forces. Turing's work laid the foundation for the concept of a programmable computer and artificial intelligence. Despite his immense contributions, he faced persecution for his homosexuality, and tragically, he died at a young age. Turing's legacy as a pioneer in computing and his impact on LGBTQ+ rights continue to be recognized and celebrated today.",
      "date": "1912-1954",
      "decade": "20th century",
      "category": "science",
      "imageUrl": "https://media.istockphoto.com/id/1147544807/vector/thumbnail-image-vector-graphic.jpg?s=612x612&w=0&k=20&c=rnCKVbdxqkjlcs3xH87-9gocETqpspHFXu5dIGB4wuM="
      "imageUrl": "https://example.com/alan-turing.jpg"
    },
    {
      "title": "Sally Ride",
      "content": "Sally Ride made history in 1983 as the first American woman to travel to space. As a physicist and astronaut, she broke barriers and inspired countless young people to pursue careers in science and space exploration. Ride's accomplishments not only highlighted her scientific prowess but also showcased the importance of gender and LGBTQ+ representation in STEM fields. Following her career at NASA, she dedicated herself to advancing science education and encouraging young girls to pursue their scientific dreams.",
      "date": "1983",
      "decade": "1980s",
      "category": "science",
      "imageUrl": "https://media.istockphoto.com/id/1147544807/vector/thumbnail-image-vector-graphic.jpg?s=612x612&w=0&k=20&c=rnCKVbdxqkjlcs3xH87-9gocETqpspHFXu5dIGB4wuM="
    },
    {
      "title": "Chien-Shiung Wu",
      "content": "Chien-Shiung Wu was a Chinese-American physicist known for her groundbreaking work on the theory of beta decay, which helped disprove the principle of conservation of parity. Her experiments provided evidence that fundamental laws of physics violated the symmetry between left and right. Wu's work challenged long-held beliefs and contributed significantly to the field of nuclear physics. Throughout her career, she faced gender and racial discrimination, but her perseverance and scientific achievements have solidified her status as one of the most influential physicists of the 20th century.",
      "date": "1937-1997",
      "decade": "20th century",
      "category": "science",
      "imageUrl": "https://media.istockphoto.com/id/1147544807/vector/thumbnail-image-vector-graphic.jpg?s=612x612&w=0&k=20&c=rnCKVbdxqkjlcs3xH87-9gocETqpspHFXu5dIGB4wuM="
    },
    {
      "title": "Ben Barres",
      "content": "Ben Barres was a neurobiologist and advocate for diversity in science. His research on the role of glial cells in the central nervous system made significant contributions to our understanding of brain development and function. Barres was the first openly transgender scientist in the National Academy of Sciences and used his platform to raise awareness about the challenges faced by LGBTQ+ individuals in academia. He was a strong advocate for gender equality and fought against discrimination in science. Barres' scientific achievements and activism continue to inspire future generations of scientists.",
      "date": "1954-2017",
      "decade": "20th century",
      "category": "science",
      "imageUrl": "https://media.istockphoto.com/id/1147544807/vector/thumbnail-image-vector-graphic.jpg?s=612x612&w=0&k=20&c=rnCKVbdxqkjlcs3xH87-9gocETqpspHFXu5dIGB4wuM="
    },
    {
      "title": "Sara Josephine Baker",
      "content": "Sara Josephine Baker was an American physician and public health pioneer. She played a crucial role in advancing child health and combating infectious diseases in New York City. Baker's work led to significant improvements in sanitation and the reduction of infant mortality rates. She was also openly lesbian and lived with her partner for many years. Baker's dedication to public health and her contributions to healthcare have left a lasting impact on society.",
      "date": "1873-1945",
      "decade": "20th century",
      "category": "science",
      "imageUrl": "https://media.istockphoto.com/id/1147544807/vector/thumbnail-image-vector-graphic.jpg?s=612x612&w=0&k=20&c=rnCKVbdxqkjlcs3xH87-9gocETqpspHFXu5dIGB4wuM="
    },

    {
      "title": "Harvey Milk",
      "content": "Harvey Milk was an American politician and the first openly gay elected official in California. As a member of the San Francisco Board of Supervisors, Milk advocated for LGBTQ+ rights, social justice, and equality. His influential tenure was tragically cut short when he was assassinated in 1978, but his impact on the LGBTQ+ community and the fight for equal rights continues to resonate today. Milk's dedication to public service and his unwavering commitment to inclusivity have made him an iconic figure in LGBTQ+ history.",
      "date": "1930-1978",
      "decade": "20th century",
      "category": "politics",
      "imageUrl": "https://media.istockphoto.com/id/1147544807/vector/thumbnail-image-vector-graphic.jpg?s=612x612&w=0&k=20&c=rnCKVbdxqkjlcs3xH87-9gocETqpspHFXu5dIGB4wuM="
    },
    {
      "title": "Angela Davis",
      "content": "Angela Davis is a political activist, scholar, and former member of the Communist Party USA. Throughout her career, Davis has been an outspoken advocate for civil rights, feminism, and LGBTQ+ rights. Her work has focused on combating institutionalized racism, mass incarceration, and other forms of systemic oppression. Davis's contributions to social justice and her steadfast commitment to equality have solidified her as a prominent figure in progressive politics.",
      "date": "1944-present",
      "decade": "21st century",
      "category": "politics",
      "imageUrl": "https://media.istockphoto.com/id/1147544807/vector/thumbnail-image-vector-graphic.jpg?s=612x612&w=0&k=20&c=rnCKVbdxqkjlcs3xH87-9gocETqpspHFXu5dIGB4wuM="
    },
    {
      "title": "Tammy Baldwin",
      "content": "Tammy Baldwin is an American politician who made history in 2012 as the first openly gay senator elected to the United States Senate. Representing the state of Wisconsin, Baldwin has been a strong advocate for affordable healthcare, economic fairness, and LGBTQ+ rights. Throughout her career, she has fought against discrimination and worked towards creating a more inclusive society. Baldwin's historic election and her continued efforts in Congress have paved the way for LGBTQ+ representation in politics.",
      "date": "1962-present",
      "decade": "21st century",
      "category": "politics",
      "imageUrl": "https://encrypted-tbn0.gstatic.com/licensed-image?q=tbn:ANd9GcT2pKzIQz6XrsRDOlWkUowwUWHz8tMHz11E5oYRgAH04Zmc0UIIUFECMuRSdYGsWy0QOZcOQUNWTt88hYM"
    },
    {
      "title": "Leo Varadkar",
      "content": "Leo Varadkar is an Irish politician who made history in 2017 when he became the first openly gay Taoiseach (Prime Minister) of Ireland. Varadkar has been a vocal advocate for LGBTQ+ rights and has worked to advance equality and social progress in Ireland. His leadership has helped shape public opinion and policies, making Ireland a more inclusive and accepting country. Varadkar's achievements have had a significant impact on LGBTQ+ representation in politics globally.",
      "date": "1979-present",
      "decade": "21st century",
      "category": "politics",
      "imageUrl": "https://www.irishtimes.com/resizer/MVPuj-OSkB6QHr5BG6uJAl6m-w4=/1600x0/filters:format(jpg):quality(70):focal(2218x1579:2228x1589)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/FZTLOC4S2ENRAKTNMRE2AP2EIQ.jpg"
    },
    {
      "title": "Christine Burns",
      "content": "Christine Burns is a British political activist and one of the key figures in the fight for transgender rights. She played a pivotal role in advocating for the Gender Recognition Act 2004, which granted legal recognition to transgender individuals in the UK. Burns has worked tirelessly to challenge stereotypes, educate the public, and promote inclusivity and equality for transgender people. Her activism has had a lasting impact on transgender rights and paved the way for progress in the UK and beyond.",
      "date": "1954-present",
      "decade": "21st century",
      "category": "politics",
      "imageUrl": "https://media.istockphoto.com/id/1147544807/vector/thumbnail-image-vector-graphic.jpg?s=612x612&w=0&k=20&c=rnCKVbdxqkjlcs3xH87-9gocETqpspHFXu5dIGB4wuM="
    },
    {
      "category": "science",
      "content": "Harald zur Hausen's contributions to science and his research on human papillomavirus (HPV) and its link to cervical cancer did not directly address the perspective that gay individuals created AIDS. However, his work, along with other scientists, has helped challenge and debunk the misconceptions and stigmatizing beliefs surrounding the origins and transmission of HIV/AIDS. By identifying HPV as a separate virus with its own associated health risks, zur Hausen's research has contributed to a more accurate understanding of different viruses and their respective impacts on public health. This has played a part in dispelling unfounded notions linking HIV/AIDS exclusively to the gay community and promoting a more inclusive and evidence-based perspective on the disease.",
      "date": "07-12-2008",
      "decade": "2000",
      "imageUrl": "https://github.com/nils-n/progress-timeline/blob/main/assets/images/Harald_zur_Hausen-press_conference.jpeg?raw=true",
      "title": "Harald zur Hausen"
    },
    {
      "category": "science",
      "content": "Susan Stryker is a prominent transgender historian, filmmaker, and gender theorist who has made substantial contributions to transgender studies and activism. Her work focuses on the intersection of gender, sexuality, and identity. Stryker co-directed the documentary film 'Screaming Queens: The Riot at Compton's Cafeteria' which highlights the resistance of transgender women against police violence in 1966 San Francisco. She has also written influential texts on transgender history, including 'Transgender History which provides a comprehensive overview of the transgender experience throughout time. Stryker's scholarship has been instrumental in raising awareness, promoting understanding, and advocating for the rights of transgender individuals.",
      "date": "07-12-94",
      "decade": "1990",
      "imageUrl": "https://github.com/nils-n/progress-timeline/blob/main/assets/images/Trans_March_San_Francisco_2017?raw=true",
      "title": "Susan Stryker"
    },
    {
      "category": "sport",
      "content": "As of 27 May 2016 she was the reigning Olympic, World and European Games champion at flyweight, and won the entire set of amateur championships available to her – Olympic. She is openly lesbian, and was named the most influential LGBT person in Britain by The Independent in 2012 and has been included in the annual Powerlist, being recognised as one of the most influential black Britons. She also became the first openly LGBT person to win an Olympic boxing gold medal, after her win at the 2012 Summer Olympics.",
      "date": "27-05-016",
      "decade": "2010",
      "imageUrl": "https://github.com/nils-n/progress-timeline/blob/main/assets/images/Nicola_Adams_-_Our_Greatest_Team_Parade.jpeg?raw=true",
      "title": "Nicola Virginia Adams"
    },
    {
      "category": "sport",
      "content": "Amaechi became the first former NBA player to publicly come out as gay after doing so in his memoir Man in the Middle. Since then, he has been regarded as 'one of the world's most high-profile gay athletes'.",
      "date": "01-02-07",
      "decade": "2000",
      "imageUrl": "https://github.com/nils-n/progress-timeline/blob/main/assets/images/John_Amaechi_OBE.jpeg?raw=true",
      "title": "John Amaechi"
    },
    {
      "category": "sport",
      "content": "Buschbaum competed in women's pole vaulting before his gender transition, winning the title of German Youth Champion multiple times. In January 2008, Buschbaum announced that his new first name was 'Balian', after the blacksmith in the movie Kingdom of Heaven, and that he would undergo gender affirming surgery later that year.",
      "date": "01-01-08",
      "decade": "2000",
      "imageUrl": "https://github.com/nils-n/progress-timeline/blob/main/assets/images/Balian_Buschbaum.jpeg?raw=true",
      "title": "Lucy Bronze"
    }
  ],
  "template": [
    {
      "category": "science",
      "content": "dummycontent",
      "date": "01-01-01",
      "decade": "1980",
      "imageUrl": "https://github.com/nils-n/progress-timeline/blob/main/assets/images/DADT_repeal.jpeg?raw=true",
      "title": "dummy"
    }
  ]
}
